In [2]:
import numpy as np

**1. Write a Python program which iterates the integers from 1 to 50. For multiples of 3 print "Fizz" instead of the number and for the multiples of 5 print "Buzz". For numbers which are multiples of both 3 and 5 print "FizzBuzz".**

In [4]:
n=1
while(n<=50):
    if((n%3==0) & (n%5==0)):
        print("FizzBuzz \t",n)
    elif(n%5==0):
        print("Buzz \t",n)
    elif(n%3==0):
        print("Fizz \t", n)
    else:
        print(n)
    n+=1
print("done")

1
2
Fizz 	 3
4
Buzz 	 5
Fizz 	 6
7
8
Fizz 	 9
Buzz 	 10
11
Fizz 	 12
13
14
FizzBuzz 	 15
16
17
Fizz 	 18
19
Buzz 	 20
Fizz 	 21
22
23
Fizz 	 24
Buzz 	 25
26
Fizz 	 27
28
29
FizzBuzz 	 30
31
32
Fizz 	 33
34
Buzz 	 35
Fizz 	 36
37
38
Fizz 	 39
Buzz 	 40
41
Fizz 	 42
43
44
FizzBuzz 	 45
46
47
Fizz 	 48
49
Buzz 	 50
done

**2. Write a Python program to count the number of even and odd numbers from a tuple of numbers.**
<br>
numbers=(12,15,3,6,26,33,56,65,78,37,42,99)

In [7]:
num=(12,15,3,6,26,33,56,65,78,37,42,99)
for i in num:
    if(i%2==0):
        print("even \t",i)
    else:
        print("odd \t",i)

even 	 12
odd 	 15
odd 	 3
even 	 6
even 	 26
odd 	 33
even 	 56
odd 	 65
even 	 78
odd 	 37
even 	 42
odd 	 99

**3. Take 5 integers from keyboard using a loop and print their average value on the screen.**

In [3]:
#import numpy as np
list1=[]
a=1
sum=0
while(a<=5):
    value=int(input("enter number for a"))
    list1.append(value)
    a+=1
print(list1)
for i in list1:
    sum=sum+i
print(sum)
avg=sum/len(list1)
print(avg)

enter number for a1
enter number for a7
enter number for a7
enter number for a4
enter number for a5
[1, 7, 7, 4, 5]
24
4.8

**4. Following are the tuples of students who have enrolled for two courses. Find out those students who have enrolled for both the courses.**
<br>
course_A=('Anuj', 'Katrina', 'John', 'Jessica', 'Michael', 'Rahul', 'Khushboo')
<br>
course_B=('Bhavana', 'Katrina','Michael', 'Robert', 'Khushboo', 'Sachin' )

In [ ]:
course_A=('Anuj', 'Katrina', 'John', 'Jessica', 'Michael', 'Rahul', 'Khushboo') 
course_B=('Bhavana', 'Katrina','Michael', 'Robert', 'Khushboo', 'Sachin' )
list1 =

**5. Write a Python function to create and print a list where the values are square of numbers between 1 and 25 (both included).**

In [1]:
#list1=[]
#a=1
#while(a<=25):
 #   value=int(input("number a \t"))
  #  list1.append(value)
   # a+=1
#print(list1)
#for i in list1:
 #       print(i,"\t" ,i**2)
import numpy as np
a=np.arange(1,26,1)
print(a)
print(a**2)

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25]
[  1   4   9  16  25  36  49  64  81 100 121 144 169 196 225 256 289 324
 361 400 441 484 529 576 625]

In [3]:
import pandas as pd

**6. Write a Pandas program to create a Series out of the given list and sort it in the descending order.**
<br>
data_list=['1000', 'spyder', 'python', 'jupyter', '400.78', 'anaconda']

In [4]:
data=['1000','spyder','python','jupyter','400.78','anaconda']
s=pd.Series(data)
print(s)
print(s[-1:-5])

0        1000
1      spyder
2      python
3     jupyter
4      400.78
5    anaconda
dtype: object
Series([], dtype: object)

**7. Create a series out of a range of values from 1 to 10. Ask the user to specify how many observations should be displayed and print that many observations from the series.**

In [4]:
b=np.arange(1,10,2)
print(b)

[1 3 5 7 9]

**8. Write a Pandas program to create the mean and standard deviation of the data of a given Series.**
<br>
data_list = [1,2,3,4,5,6,7,8,9,5,3]

In [66]:
data_list=[1,2,3,4,5,6,7,8,9,5,3]
df=pd.DataFrame(data_list)
df.std()

0    2.522625
dtype: float64

**9. Write a Pandas program to display a summary of the basic information about the DataFrame and its data.**
<br>
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'],
'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [57]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'],
'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df=pd.DataFrame(exam_data,index=['a','b','c','d','e','f','g','h','i','j'])
df

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John    8.0         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**10. Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the above data frame.**

In [58]:
df[['name','score']]

       name  score
a      Anuj   12.5
b   Bhavana    9.0
c   Katrina   16.5
d      John    8.0
e   Jessica    9.0
f   Michael   20.0
g    Robert   14.5
h     Rahul    5.0
i  Khushboo    8.0
j    Sachin   19.0

**11. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2 and still did not qualify.**

In [59]:
df.loc[(df.attempts >=2) & (df.qualify=='no')]

       name  score  attempts qualify
b   Bhavana    9.0         3      no
d      John    8.0         3      no
e   Jessica    9.0         2      no
i  Khushboo    8.0         2      no

**12. Write a Pandas program to change the score in row 'd' to 11.5.**

In [60]:
df.loc[(df.name=='John') & (df.score == 8.0),["name","score"]]=["John",11.5]
df

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John   11.5         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

In [51]:
df

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John    8.0         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**13. Write a Pandas program to change the name 'Jessica' to 'Suresh' in name column of the DataFrame.**

In [64]:
df.loc[(df.name =="Jessica"),["name"]]=["suresh"]
df

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John   11.5         3      no
e    suresh    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**14. Write a Pandas program to delete the 'attempts' column from the DataFrame.**

In [65]:
del df["attempts"]
df

       name  score qualify
a      Anuj   12.5     yes
b   Bhavana    9.0      no
c   Katrina   16.5     yes
d      John   11.5      no
e    suresh    9.0      no
f   Michael   20.0     yes
g    Robert   14.5     yes
h     Rahul    5.0      no
i  Khushboo    8.0      no
j    Sachin   19.0     yes

**15. Write a Pandas program to rearrange the columns of the dataframe. Follow the order:**
<br>
Qualify, Name, Score